# 1. Напишите функцию, которая принимает одно число и
# проверяет, является ли оно простым

# def  Prime (n):
#     i = 2
#     while i < n-1:
#         if n%i == 0:
#             return("No")
#             break 
#         else:
#             i += 1
#     else:
#         return("Yes")
# print(Prime(41))

# 2. Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.

    
# def rev(n):
#     if (n>0):
#         nam = int(input("Ведите числа: ")) 
#         rev( n-1 )
#         print(nam, end="")
# n = int(input("Введите число N: ")) 
# rev(n)
